// @strict-types

#Область ОбработчикиСобытий

// Обработчик команды печати билета.
// Создает и отображает печатную форму билета.
//
// Параметры:
//  ПараметрКоманды - ДокументСсылка.ПродажаБилета - ссылка на печатаемый документ
//  ПараметрыВыполненияКоманды - ПараметрыВыполненияКоманды - параметры выполнения команды
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Билет)
	ТабДок = Новый ТабличныйДокумент;
	Билет(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Обработчик команды печати на сервере.
// Вызывает процедуру формирования печатной формы билета.
//
// Параметры:
//  ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати
//  ПараметрКоманды - ДокументСсылка.ПродажаБилета - ссылка на документ "Продажа билета"
&НаСервере
Процедура Билет(ТабДок, ПараметрКоманды)
	
	Документы.ПродажаБилета.Билет(ТабДок, ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти

